app/controllers/posts_controller.rb

  def index
    @posts = Post.all
    @city = City.find_by_id(params[:city_id])
---
SELECT "posts".* FROM "posts"
SELECT  "cities".* FROM "cities" WHERE "cities"."id" = $1 LIMIT 1  [["id", 1]]

  def new
    @post = Post.new
    @city = City.find_by_id(params[:city_id])
---
SELECT  "cities".* FROM "cities" WHERE "cities"."id" = $1 LIMIT 1  [["id", 1]]

  def create

    post_params = params[:post]
    post = Post.new({title: post_params[:title], description: post_params[:description]})
    # @post = current_user.posts.build(params[:city_id])
    if post.save
    city = City.find(params[:city_id])
    city.posts << post
    current_user.posts << post
      if city.save && current_user.save
---
INSERT INTO "posts" ("title", "description", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "asdfasdf"], ["description", "asdfasdf"], ["user_id", 3], ["created_at", "2016-06-22 00:46:25.729016"], ["updated_at", "2016-06-22 00:46:25.729016"]]
SELECT  "cities".* FROM "cities" WHERE "cities"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "posts" SET "user_id" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["user_id", 3], ["updated_at", "2016-06-22 02:59:03.290507"], ["id", 7]]

  def show
    @post = Post.find(params[:id])
    @city = @post.city_id
    @first_name = @post.user.first_name
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "cities".* FROM "cities" WHERE "cities"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]

  def update
    @post = Post.find(params[:id])
    @post.update(post_params)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 25]]
UPDATE "posts" SET "title" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["title", "This is Spam~"], ["updated_at", "2016-06-23 18:53:06.546104"], ["id", 25]]

  def destroy
    @post = Post.find(params[:id])
    city = City.find(params[:city_id])
    @post.destroy
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "cities".* FROM "cities" WHERE "cities"."id" = $1 LIMIT 1  [["id", 1]]
DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 1]]